In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('adult.data.csv')

LetÂ´s see some general information about the dataset

In [35]:
df.sample(3)             #a few random rows

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
18773,45,State-gov,103406,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,1977,60,United-States,>50K
29734,25,Private,69413,Some-college,10,Never-married,Sales,Own-child,White,Female,0,0,40,United-States,<=50K
21230,18,Private,352640,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Female,0,0,40,United-States,<=50K

In [8]:
df.describe()        #General statistics of numerical variables

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [40]:
df.info()        #We have no nulls values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

1)  How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

In [37]:
df.race.unique()            #unique values of race

array(['White', 'Black', 'Asian-Pac-Islander', 'Amer-Indian-Eskimo',
       'Other'], dtype=object)

In [39]:
race_count=df.groupby('race')['race'].count()       #group data and count each race
race_count

race
Amer-Indian-Eskimo      311
Asian-Pac-Islander     1039
Black                  3124
Other                   271
White                 27816
Name: race, dtype: int64

2)  What is the average age of men?

In [32]:
df_male=df[df.sex=='Male']
average_age_men=df_male.age.mean().round(1)                 #filter 'male' rows and get the mean
average_age_men

39.4

3) What is the percentage of people who have a Bachelor's degree?

In [7]:
df.education.unique()                       #see unique values of 'education'

array(['Bachelors', 'HS-grad', '11th', 'Masters', '9th', 'Some-college',
       'Assoc-acdm', 'Assoc-voc', '7th-8th', 'Doctorate', 'Prof-school',
       '5th-6th', '10th', '1st-4th', 'Preschool', '12th'], dtype=object)

In [31]:
percentage_bachelors=round(len(df[df.education=='Bachelors'])/len(df)*100,1)            #divide total of rows with 'Bachelors' education by total of rows
percentage_bachelors

16.4

4.  What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

5.  What percentage of people without advanced education make more than 50K?

In [70]:
mask_high_educ=df['education'].isin(['Bachelors','Masters','Doctorate'])
df_high_educ=df[mask_high_educ]                                             #apply mask of advanced education
higher_education = len(df_high_educ)                                        #get total of people with advanced education

In [71]:
higher_education_rich=round(len(df_high_educ[df_high_educ.salary=='>50K'])/higher_education*100,1)      #percentage of advanced education that make more than 50K
higher_education_rich

46.5

In [72]:
mask_low_educ=df['education'].isin(['Bachelors','Masters','Doctorate'])         #same thing for lower education
df_low_educ=df[-mask_high_educ]
lower_education = len(df_low_educ)

In [73]:
lower_education_rich=round(len(df_low_educ[df_low_educ.salary=='>50K'])/lower_education*100,1)
lower_education_rich

17.4

6.  What is the minimum number of hours a person works per week (hours-per-week feature)?

In [79]:
min_work_hours=df['hours-per-week'].min()                   #get minimum value of column 'hours-per-week'
min_work_hours

1

7.  What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [87]:
df_min_hours=df[df['hours-per-week']==min_work_hours]                                               #get a df with only minimum hours-per-week
num_min_workers = len(df_min_hours)                                                                 #total rows with minimum hours-per-week
rich_percentage = round(len(df_min_hours[df_min_hours.salary=='>50K'])/len(df_min_hours)*100,1)     #percentage that has a salary of >50K
rich_percentage

8.  What country has the highest percentage of people that earn >50K?

In [ ]:
country_count=df.groupby('native-country')['native-country'].count()        #group by country

In [171]:
df_rich=df[df.salary=='>50K']
country_rich_count=df_rich.groupby(['native-country','salary'])['salary'].count()   #group by country and salary >50K
country_rich_count

native-country      salary
?                   >50K       146
Cambodia            >50K         7
Canada              >50K        39
China               >50K        20
Columbia            >50K         2
Cuba                >50K        25
Dominican-Republic  >50K         2
Ecuador             >50K         4
El-Salvador         >50K         9
England             >50K        30
France              >50K        12
Germany             >50K        44
Greece              >50K         8
Guatemala           >50K         3
Haiti               >50K         4
Honduras            >50K         1
Hong                >50K         6
Hungary             >50K         3
India               >50K        40
Iran                >50K        18
Ireland             >50K         5
Italy               >50K        25
Jamaica             >50K        10
Japan               >50K        24
Laos                >50K         2
Mexico              >50K        33
Nicaragua           >50K         2
Peru                >50K         2
Philippines         >50K        61
Poland              >50K        12
Portugal            >50K         4
Puerto-Rico         >50K        12
Scotland            >50K         3
South               >50K        16
Taiwan              >50K        20
Thailand            >50K         3
Trinadad&Tobago     >50K         2
United-States       >50K      7171
Vietnam             >50K         5
Yugoslavia          >50K         6
Name: salary, dtype: int64

In [ ]:
dfx=country_rich_count/country_count*100,1                                      #get percentage of rich people for country
highest_earning_country = dfx.idxmax()[0]                                       #get country with highest percentage
highest_earning_country_percentage=round(dfx[highest_earning_country][0],1)     #get the percentage

9.  Identify the most popular occupation for those who earn >50K in India.

In [ ]:
df_rich_india=df_rich[df_rich['native-country']=='Iran']    #filter rows with 'India' and '50K'
df_rich_india.occupation.mode()[0]                          #get mode of column 'occupation'